//Напишите программу, которая на вход принимает два числа и проверяет,
// является ли первое число квадратом второго.
Console.Write("Input number: ");
int number = Convert.ToInt32(Console.ReadLine()); //преобразуем строку в число

Console.WriteLine(number*number);