//Напишите программу, которая на вход принимает число и выдает
//  его квадрат (число умноженное на само себя).

Console.Write("Input number: ");
int number = Convert.ToInt32(Console.ReadLine()); //преобразуем строку в число

Console.WriteLine(number*number);